Tekla Open API Reference for Tekla Structures 2025
TemplateInfo Properties
The TemplateInfo type exposes the following members.
Properties
Name | Description
Name
 Gets or sets the name of the template file. E.g. "revision".
Top
See Also
Reference
TemplateInfo Class
Tekla.Structures.Drawing Namespace